Public Member Functions | List of all members
ACAPI::ElementDefault Class Reference
Element Manager
A base class for all element defaults. More...
#include <ElementDefault.hpp>
 Inheritance diagram for ACAPI::ElementDefault:
 Public Member Functions
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A base class for all element defaults.
This class represents the default state of Archicad elements. When an element is placed in Archicad, either from the API of from the UI, it always uses the Element Defaults as its default parameters.
Constructor & Destructor Documentation
◆ ElementDefault()
 ACAPI::ElementDefault::ElementDefault  |  ( |  std::shared_ptr< Impl::ElementDefaultImpl > |  impl | )
Constructs a new ElementDefault.
Parameters
impl | Impl instance of the element default.
Member Function Documentation
◆ GetElemType()
 API_ElemType ACAPI::ElementDefault::GetElemType  |  ( |   | ) |   const
Returns
The type of the element default.
◆ SetAsArchicadDefault()
 Result< void > ACAPI::ElementDefault::SetAsArchicadDefault  |  ( |   | ) |   const
Sets the locally prepared Default settings to the Archicad Default.
Returns
Error if Archicad could not apply the set of values to the Default.